# encoding: utf-8
# Name:  + class _ Cache
# Size: 734
#==============================================================================
# ** Cache
#------------------------------------------------------------------------------
# 이 모듈은 각 그래픽을 로드하고 Bitmap 객체를 생성하여 유지합니다.
# 로드 시간을 단축하고 메모리를 절약하기 위해 이 모듈은 생성된
# 프로그램이 반환할 수 있도록 내부 해시의 비트맵 객체
# 동일한 비트맵이 다시 요청될 때 기존 객체.
#==============================================================================
class << Cache
  def character(filename, hue = 0)
    load_bitmap("Graphics/Characters/", filename, hue)
  end
  
  def cache
    @cache
  end
end